Revit 2027 API
PlumbingUtils.ConnectPipePlaceholdersAtCross Method
Overload List
Name | Description
ConnectPipePlaceholdersAtCross(Document, ElementId, ElementId) |  Connects placeholders that looks like Cross connection.
ConnectPipePlaceholdersAtCross(Document, ElementId, ElementId, ElementId) |  Connects placeholders that looks like Cross connection.
ConnectPipePlaceholdersAtCross(Document, Connector, Connector, Connector, Connector) |  Connects placeholders that looks like Cross connection.
Top
See Also
Reference
PlumbingUtils Class
Autodesk.Revit.DB.Plumbing Namespace